app/controllers/admin_controller.rb

INSERT INTO `users` (`salt`, `image_file_size`, `updated_at`, `hashed_password`, `nickname`, `nickname_history`, `image_content_type`, `mobile`, `first_name`, `loginname`, `last_name`, `image_updated_at`, `email`, `created_at`, `image_file_name`) VALUES('294427800.112506983053726', NULL, '2009-08-25 16:07:03', '2d11a62c937c38d8c9e8ef62f6e9b84eb42ca365', '杜智test', NULL, NULL, 61827272, '用戶', 'nickto3', '測試', NULL, 'test@test.com', '2009-08-25 16:07:03', NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save