app/controllers/home_controller.rb

SELECT `tags`.id FROM `tags` WHERE (`tags`.`name` = BINARY '測試' AND `tags`.id <> 4) LIMIT 1
UPDATE `tags` SET `click_count` = 1 WHERE `id` = 4
---
  def tag_products
    @tag = Tag.find_by_name(params[:tag_name])
    @tag.click_count = @tag.click_count + 1
    @tag.save

SELECT * FROM `products` WHERE (`products`.`id` = 7)
---
  def product_posts
    session[:original_uri] = request.request_uri
    product = Product.find(params[:id])