app/controllers/posts_controller.rb

  def create
    post = Post.new(params[:post])
    post.good_count = 0
    post.user_id = session[:user_id]

    respond_to do |format|
      if post.save
---
INSERT INTO `posts` (`updated_at`, `good_count`, `short_title`, `product_id`, `content`, `user_id`, `created_at`) VALUES('2009-08-28 05:05:04', 0, '如果', 7, '我都有1隻', 1, '2009-08-28 05:05:04')