app/controllers/products_controller.rb

  def create
    #tags = params[:product][:tags]
    #product_params = {:product_name => params[:product][:product_name],
    #:description => params[:product][:description],
    #:image => params[:product][:image]}
    @product = Product.new(params[:product])
    #@product.tag_list.add(tags)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`image_file_size`, `normal_count`, `updated_at`, `good_count`, `image_content_type`, `description`, `click_count`, `product_name`, `image_updated_at`, `bad_count`, `created_at`, `image_file_name`) VALUES(688364, 0, '2009-08-28 16:00:47', 0, 'image/jpeg', '黑豹烈轉', 0, '黑豹', '2009-08-28 16:00:37', 0, '2009-08-28 16:00:47', '_0001.jpg')