app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM `users`

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`salt`, `image_file_size`, `updated_at`, `hashed_password`, `nickname`, `nickname_history`, `image_content_type`, `mobile`, `first_name`, `loginname`, `last_name`, `image_updated_at`, `email`, `created_at`, `image_file_name`) VALUES('307787300.593070903000038', 3608530, '2009-08-22 13:29:31', 'a67d920b959014111447d63b2c97ff55a7235c58', '杜小駒', NULL, 'image/jpeg', 61886493, '肥駒', 'nickto', '杜', '2009-08-22 13:29:13', 'nick@sofo.hk', '2009-08-22 13:29:31', 'P1010078.JPG')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `nickname` = '老老', `updated_at` = '2009-08-22 13:52:03' WHERE `id` = 1

  def message
    @inusermessages = Usermessage.find_all_by_to_user_id(params[:id])
    @outusermessages =Usermessage.find_all_by_from_user_id(params[:id])
---
SELECT * FROM `usermessages` WHERE (`usermessages`.`to_user_id` = '1')
SELECT * FROM `usermessages` WHERE (`usermessages`.`from_user_id` = '1')

  def send_message
    all_params = params[:usermessage]
    to_user = User.find_by_loginname(all_params[:to_user_name])
    respond_to do |format|
      if to_user
        new_params = {:to_user_id => to_user.id, :from_user_id => session[:user_id],
          :title => all_params[:title], :message => all_params[:message]}
        usermessage = Usermessage.new(new_params)
        usermessage.save
---
SELECT * FROM `users` WHERE (`users`.`loginname` = 'nickto2') LIMIT 1
INSERT INTO `usermessages` (`message`, `updated_at`, `title`, `to_user_id`, `from_user_id`, `created_at`) VALUES('多多指教', '2009-08-22 14:39:58', '第一次見面', 2, 1, '2009-08-22 14:39:58')